#+title: Contents

Brief table of contents and todo list.

** DONE food_acquired.py
CLOSED: [2023-03-07 Tue 21:10]
Test...
#+begin_src python :results output
import pandas as pd

fa = pd.read_parquet('../var/food_acquired.parquet')

print(fa.describe())
#+end_src

#+results:
#+begin_example
            quantity  value_purchased  ...            Kgs  Kgs Purchased
count  189663.000000    189663.000000  ...  189663.000000  189663.000000
mean      120.060827        38.112630  ...       0.475441       0.477268
std       638.640276       218.505495  ...       0.639778       0.665748
min         0.000000         0.000000  ...       0.000000       0.000000
25%         1.000000        10.000000  ...       0.000000       0.000000
50%         2.000000        20.000000  ...       0.160000       0.160000
75%        10.000000        40.000000  ...       1.000000       1.000000
max     58800.000000     70000.000000  ...      52.500000      52.500000

[8 rows x 6 columns]
#+end_example
** DONE food_prices_quantities_and_expenditures.py
CLOSED: [2023-03-07 Tue 21:12]
Test...
#+begin_src python :results output
import pandas as pd

print(pd.read_parquet('../var/food_prices.parquet').describe())
print(pd.read_parquet('../var/food_quantities.parquet').describe())
print(pd.read_parquet('../var/food_expenditures.parquet').describe())
#+end_src

#+results:
#+begin_example
          unitvalue
count  1.365890e+05
mean            inf
std             NaN
min    4.000000e-03
25%    1.200000e+01
50%    2.200000e+01
75%    4.411765e+01
max             inf
                   q
count  135606.000000
mean        1.850766
std        15.492912
min         0.000050
25%         0.400000
50%         1.000000
75%         1.783000
max      5046.800213
       value_purchased
count    188862.000000
mean         38.274273
std         218.954241
min           0.050000
25%          10.000000
50%          20.000000
75%          40.000000
max       70000.000000
#+end_example

